[
    {
      "text": "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.",
      "author": "Мартин Колдинг"
    },
    {
      "text": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
      "author": "Линус Торвальд"
    },
    {
      "text": "Повторять — человечно, рекурсивно — божественно.",
      "author": "L. Peter Deutsch" 
    },
    {
      "text": "Трудность работы с программистом заключается в том, что вы не можете понять, что он делает, до тех пор, пока не стало слишком поздно.",
      "author": "Сеймор Край"
    },
    {
      "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
      "author": "Ларри Вол"
    },
    {
      "text": "Сначала учите науку программирования и всю теорию. Далее выработайте свой программистский стиль. Затем забудьте всё и просто программируйте.",
      "author": "Григорий Carrette" 
    },
    {
      "text": "Преждевременная оптимизация — корень всех зол.",
      "author": "Дональд Кнут"
    },
    {
      "text": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать.",
      "author": "Brian W. Kernighan"
    },
    {
      "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
      "author": "Бил Гейц" 
    },
    {
      "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
      "author": "Christopher Thompson"
    },
    {
      "text": "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++.",
      "author": "Alan Kay"
    },
    {
      "text": "Perl — это тот язык, который одинаково выглядит как до, так и после RSA шифрования.",
      "author": "Кейт Бостик" 
    }
  ]